import numpy as np
import math
import task_1
import task_2


#       Задание 1
# Данные
P = np.array([
#   1       2       3       4       5       6       7       8       9       10      11      12      13      14      15
    [0.07,  0.44,   0,      0,      0.49,   0,      0,      0,      0,      0,      0,      0,      0,      0,      0   ],  # 1
    [0,     0.14,   0,      0,      0.12,   0.74,   0,      0,      0,      0,      0,      0,      0,      0,      0   ],  # 2
    [0,     0.38,   0.16,   0,      0,      0.46,   0,      0,      0,      0,      0,      0,      0,      0,      0   ],  # 3
    [0,     0,      0.17,   0.17,   0.27,   0.23,   0.16,   0,      0,      0,      0,      0,      0,      0,      0   ],  # 4
    [0.19,  0,      0,      0.38,   0.13,   0.09,   0,      0,      0,      0,      0.21,   0,      0,      0,      0   ],  # 5
    [0,     0.23,   0.11,   0,      0,      0.21,   0.3,    0,      0,      0.03,   0.12,   0,      0,      0,      0   ],  # 6
    [0,     0.42,   0,      0.18,   0,      0.32,   0.08,   0,      0,      0,      0,      0,      0,      0,      0   ],  # 7
    [0,     0,      0,      0,      0.36,   0,      0,      0.33,   0,      0,      0,      0,      0,      0,      0.31],  # 8
    [0,     0,      0,      0,      0.09,   0.12,   0.29,   0.16,   0.19,   0.02,   0,      0,      0,      0.04,   0.09],  # 9
    [0,     0,      0,      0,      0,      0,      0,      0,      0,      0.1,    0,      0.01,   0.38,   0.21,   0.3 ],  # 10
    [0,     0,      0,      0,      0.23,   0,      0.2,    0,      0,      0,      0.06,   0.23,   0,      0.09,   0.19],  # 11
    [0,     0,      0,      0,      0,      0,      0,      0.51,   0.42,   0,      0,      0.07,   0,      0,      0   ],  # 12
    [0,     0,      0,      0,      0,      0,      0,      0,      0.04,   0,      0.35,   0.21,   0.4,    0,      0   ],  # 13
    [0,     0,      0,      0,      0,      0,      0,      0.28,   0.32,   0.11,   0,      0,      0.25,   0.04,   0   ],  # 14
    [0,     0,      0,      0,      0,      0,      0,      0,      0,      0,      0.16,   0,      0,      0.75,   0.09],  # 15
])
A = np.array([0.12, 0.05, 0.11, 0.07, 0.01, 0.01, 0.11, 0.11, 0.03, 0.13, 0.08, 0.03, 0.01, 0.1, 0.03])
# Решение
print("     ЗАДАЧА 1")
print(task_1.transfer(P, 7)[11][0])

print("     ЗАДАЧА 2")
task_1.print_mx(task_1.state(P, A, 7))

print("     ЗАДАЧА 3")
print(task_1.on_step(task_1.first_transfer_gen(P), 10)[1][5])

print("     ЗАДАЧА 4")
print(task_1.not_later(task_1.first_transfer_gen(P), 10)[9][11])

print("     ЗАДАЧА 5")
print(task_1.avg(task_1.first_transfer_gen(P))[14][12])

print("     ЗАДАЧА 6")
print(task_1.on_step(task_1.first_return_gen(P), 8)[3])

print("     ЗАДАЧА 7")
print(task_1.not_later(task_1.first_return_gen(P), 8)[10])

print("     ЗАДАЧА 8")
print(task_1.avg(task_1.first_return_gen(P))[11])

print("     ЗАДАЧА 9")
task_1.print_mx(task_1.last_state(P))
